<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# Working With Time Series Data

---

### Learning Objectives
 
**After this lesson, you will be able to:**
- Identify time series data.
- Explain the challenges of working with time series data.
- Use the `datetime` library to represent dates as objects.
- Preprocess time series data with Pandas.

---

### Lesson Guide

#### Time Series Data
- [What is a Time Series](#A)
- [The Datetime Library](#B)
- [Preprocessing Time Series Data with Pandas](#C)
- [Independent Practice](#D)
----

<h2><a id="A">What is a Time Series?</a></h2>

A **time series** is a series of data points that's indexed (or listed, or graphed) in time order. Most commonly, a time series is a sequence that's taken at successive equally spaced points in time. Time series are often represented as a set of observations that have a time-bound relation, which is represented as an index.

Time series are commonly found in sales, analysis, stock market trends, economic phenomena, and social science problems.

These data sets are often investigated to evaluate the long-term trends, forecast the future, or perform some other form of analysis.

> **Check for Understanding:** List some examples of real-world time series data.

### Let's take a look at some Apple stock data to get a feel for what time series data look like.

In [1]:
import pandas as pd
from datetime import timedelta
%matplotlib inline

aapl = pd.read_csv("data/aapl.csv")

Take a high-level look at the data. What are we looking at?

In [2]:
aapl.head()

        Date    Open    High     Low   Close    Volume
0  13-Jan-17  119.11  119.62  118.81  119.04  26111948
1  12-Jan-17  118.90  119.30  118.21  119.25  27086220
2  11-Jan-17  118.74  119.93  118.60  119.75  27588593
3  10-Jan-17  118.77  119.38  118.30  119.11  24462051
4   9-Jan-17  117.95  119.43  117.94  118.99  33561948

In [3]:
aapl.describe()

             Open        High         Low       Close        Volume
count  251.000000  251.000000  251.000000  251.000000  2.510000e+02
mean   105.155100  106.060518  104.392550  105.292191  3.674495e+07
std      7.905047    7.876708    7.995679    7.963102  1.609059e+07
min     90.000000   91.670000   89.470000   90.340000  1.147592e+07
25%     97.355000   98.220000   96.690000   97.340000  2.665144e+07
50%    106.270000  107.270000  105.500000  106.100000  3.229234e+07
75%    111.450000  112.370000  110.700000  111.750000  4.137394e+07
max    119.110000  119.930000  118.810000  119.750000  1.322245e+08

<h2><a id="B">The DateTime library</a></h2>

As time is important to time series data, we will need to interpret these data in the ways that humans interpret them (which is many ways). 

Python's `DateTime` library is great for dealing with time-related data, and Pandas has incorporated this library into its own `datetime` series and objects.

In this lesson, we'll review these data types and learn a little more about each of them:

* `datetime` objects.
* `datetime` series.
* Timestamps.
* `timedelta()`.

### `datetime` Objects

Below, we'll load in the `DateTime` library, which we can use to create a `datetime` object by entering in the different components of the date as arguments.

In [4]:
# The datetime library is something you should already have from Anaconda.
from datetime import datetime

In [5]:
# Let's just set a random datetime â€” not the end of the world or anything.
lesson_date = datetime(2012, 12, 21, 12, 21, 12, 844089)

The components of the date are accessible via the object's attributes.

In [6]:
print("Micro-Second", lesson_date.microsecond)
print("Second", lesson_date.second)
print("Minute", lesson_date.minute)
print("Hour", lesson_date.hour)
print("Day", lesson_date.day)
print("Month",lesson_date.month)
print("Year", lesson_date.year)

Micro-Second 844089
Second 12
Minute 21
Hour 12
Day 21
Month 12
Year 2012

### `timedelta()`

Suppose we want to add time to or subtract time from a date. Maybe we're using time as an index and want to get everything that happened a week before a specific observation.

We can use a `timedelta` object to shift a `datetime` object. Here's an example:

In [7]:
# Import timedelta() from the DateTime library.
from datetime import timedelta

# Timedeltas represent time as an amount rather than as a fixed position.
offset = timedelta(days=1, seconds=20)

# The timedelta() has attributes that allow us to extract values from it.
print('offset days', offset.days)
print('offset seconds', offset.seconds)
print('offset microseconds', offset.microseconds)

offset days 1
offset seconds 20
offset microseconds 0

`datetime`'s `.now()` function will give you the `datetime` object of this very moment.

In [8]:
now = datetime.now()
print("Like Right Now: ", now)

Like Right Now:  2018-06-11 18:45:48.670805

The current time is particularly useful when using `timedelta()`.

In [9]:
print("Future: ", now + offset)
print("Past: ", now - offset)

Future:  2018-06-12 18:46:08.670805
Past:  2018-06-10 18:45:28.670805

*Note: The largest value a `timedelta()` can hold is days. For instance, you can't say you want your offset to be two years, 44 days, and 12 hours; you have to convert those years to days.*

You can read more about the `timedelta()` category [here](https://docs.python.org/2/library/datetime.html).

### Guided Practice: Apple Stock Data

We can practice using `datetime` functions and objects using Apple stock data.

In [10]:
aapl.head()

        Date    Open    High     Low   Close    Volume
0  13-Jan-17  119.11  119.62  118.81  119.04  26111948
1  12-Jan-17  118.90  119.30  118.21  119.25  27086220
2  11-Jan-17  118.74  119.93  118.60  119.75  27588593
3  10-Jan-17  118.77  119.38  118.30  119.11  24462051
4   9-Jan-17  117.95  119.43  117.94  118.99  33561948

The `Date` column starts off as an object.

In [11]:
aapl.dtypes

Date       object
Open      float64
High      float64
Low       float64
Close     float64
Volume      int64
dtype: object

<h2><a id="C">Preprocessing Time Series Data with Pandas</a><h2>

### Convert time data to a `datetime` object.

Overwrite the original `Date` column with one that's been converted to a `datetime` series.

In [12]:
aapl['Date'] = pd.to_datetime(aapl.Date)

We can see these changes reflected in the `Date` column structure.

In [13]:
aapl.head()

        Date    Open    High     Low   Close    Volume
0 2017-01-13  119.11  119.62  118.81  119.04  26111948
1 2017-01-12  118.90  119.30  118.21  119.25  27086220
2 2017-01-11  118.74  119.93  118.60  119.75  27588593
3 2017-01-10  118.77  119.38  118.30  119.11  24462051
4 2017-01-09  117.95  119.43  117.94  118.99  33561948

We can also see that the `Date` object has changed.

In [14]:
aapl.dtypes

Date      datetime64[ns]
Open             float64
High             float64
Low              float64
Close            float64
Volume             int64
dtype: object

### The `.dt` Attribute

Pandas' `datetime` columns have a `.dt` attribute that allows you to access attributes that are specific to dates. For example:

    aapl.Date.dt.day
    aapl.Date.dt.month
    aapl.Date.dt.year
    aapl.Date.dt.weekday_name

And, there are many more!

In [15]:
aapl.Date.dt.weekday_name.head()

0       Friday
1     Thursday
2    Wednesday
3      Tuesday
4       Monday
Name: Date, dtype: object

In [16]:
aapl.Date.dt.dayofyear.head()

0    13
1    12
2    11
3    10
4     9
Name: Date, dtype: int64

Check out the Pandas `.dt` [documentation](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.dt.html) for more information.

### Timestamps

Timestamps are useful objects for comparisons. You can create a timestamp object using the `pd.to_datetime()` function and a string specifying the date. These objects are especially helpful when you need to perform logical filtering with dates.

In [17]:
ts = pd.to_datetime('1/1/2017')
ts

Timestamp('2017-01-01 00:00:00')

The main difference between a `datetime` object and a timestamp is that timestamps can be used as comparisons.

Let's use the timestamp `ts` as a comparison with our Apple stock data.

In [18]:
aapl.loc[aapl.Date >= ts].head()

        Date    Open    High     Low   Close    Volume
0 2017-01-13  119.11  119.62  118.81  119.04  26111948
1 2017-01-12  118.90  119.30  118.21  119.25  27086220
2 2017-01-11  118.74  119.93  118.60  119.75  27588593
3 2017-01-10  118.77  119.38  118.30  119.11  24462051
4 2017-01-09  117.95  119.43  117.94  118.99  33561948

We can even get the first and last dates from a time series.

In [19]:
aapl.Date.max() - aapl.Date.min()

Timedelta('360 days 00:00:00')

> **Check for Understanding:** Why do we convert the DataFrame column containing the time information into a `datetime` object?

### Set `datetime` to Index the DataFrame

After converting the column containing time data from object to `datetime`, it is also useful to make the index of the DataFrame a `datetime`.

In [20]:
aapl.head()

        Date    Open    High     Low   Close    Volume
0 2017-01-13  119.11  119.62  118.81  119.04  26111948
1 2017-01-12  118.90  119.30  118.21  119.25  27086220
2 2017-01-11  118.74  119.93  118.60  119.75  27588593
3 2017-01-10  118.77  119.38  118.30  119.11  24462051
4 2017-01-09  117.95  119.43  117.94  118.99  33561948

Let's set the `Date` column as the index.

In [21]:
aapl.set_index('Date', inplace=True)

In [22]:
aapl.head()

              Open    High     Low   Close    Volume
Date
2017-01-13  119.11  119.62  118.81  119.04  26111948
2017-01-12  118.90  119.30  118.21  119.25  27086220
2017-01-11  118.74  119.93  118.60  119.75  27588593
2017-01-10  118.77  119.38  118.30  119.11  24462051
2017-01-09  117.95  119.43  117.94  118.99  33561948

### Filtering by Date with Pandas

It is easy to filter by date using Pandas. Let's create a subset of data containing only the stock prices from 2017. We can specify the index as a string constant.

In [23]:
aapl['2017']

              Open    High     Low   Close    Volume
Date
2017-01-13  119.11  119.62  118.81  119.04  26111948
2017-01-12  118.90  119.30  118.21  119.25  27086220
2017-01-11  118.74  119.93  118.60  119.75  27588593
2017-01-10  118.77  119.38  118.30  119.11  24462051
2017-01-09  117.95  119.43  117.94  118.99  33561948
2017-01-06  116.78  118.16  116.47  117.91  31751900
2017-01-05  115.92  116.86  115.81  116.61  22193587
2017-01-04  115.85  116.51  115.75  116.02  21118116
2017-01-03  115.80  116.33  114.76  116.15  28781865

There are a few things to note about indexing with time series. Unlike numeric indexing, the end index will be included. If you want to index with a range, the time indices must be sorted first.

> **Recap:** The steps for preprocessing time series data are to:
* Convert time data to a `datetime` object.
* Set `datetime` to index the DataFrame.

In [25]:
aapl.resample('M').mean()

                  Open        High         Low       Close        Volume
Date
2016-01-31   97.252222   98.564444   95.510000   97.272222  6.766593e+07
2016-02-29   95.696000   96.727500   94.711500   95.746500  4.016202e+07
2016-03-31  103.816818  104.897273  103.231364  104.267273  3.367371e+07
2016-04-30  106.785714  107.759048  105.855238  106.739048  4.038861e+07
2016-05-31   94.958095   95.694762   94.048571   94.974762  4.268420e+07
2016-06-30   96.588636   97.477727   95.969091   96.622273  3.548319e+07
2016-07-31   98.450500   99.163500   98.002500   98.556500  3.428898e+07
2016-08-31  107.462609  108.140435  106.986522  107.665217  2.739689e+07
2016-09-30  110.673333  111.745238  109.807619  110.857143  4.617282e+07
2016-10-31  115.743810  116.388095  114.941429  115.707143  3.271020e+07
2016-11-30  110.098571  111.068095  108.988571  110.154286  3.432798e+07
2016-12-31  113.995238  115.025238  113.544762  114.335714  2.898913e+07
2017-01-31  117.535556  118.391111  117.183333  118.092222  2.696180e+07

In [28]:
aapl.resample('M').first()
aapl.resample('M').last()
aapl.resample('Y').first()
aapl.resample('Q').first()

              Open    High     Low   Close    Volume
Date
2016-03-31   98.41   98.65   95.50   96.66  52841349
2016-06-30  108.78  110.00  108.20  109.99  25626163
2016-09-30   95.49   96.46   95.33   95.89  26026540
2016-12-31  112.71  113.05  112.28  112.52  21701760
2017-03-31  115.80  116.33  114.76  116.15  28781865

# Recap

* We use time series analysis to identify changes in values over time.
* The `datetime` library makes working with time data more convenient.
* To preprocess time series data with Pandas, you:
    1. Convert the time column to a `datetime` object.
    2. Set the time column as the index of the DataFrame.

<h2><a id="D">Independent Practice</a></h2>

**Instructor Note**: These are optional and can be assigned as student practice questions outside of class.

### 1) Create a `datetime` object representing today's date.

In [55]:
today = datetime.now().date()

In [58]:
datetime.today()

datetime.datetime(2018, 6, 11, 19, 10, 13, 394596)

In [59]:
datetime.now()

datetime.datetime(2018, 6, 11, 19, 10, 28, 321598)

In [57]:
datetime.today() == datetime.now()

False

### 2) Load the UFO data set from the internet.

In [34]:
import pandas as pd
from datetime import timedelta
%matplotlib inline

ufo = pd.read_csv('http://bit.ly/uforeports')

In [35]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

### 3) Convert the `Time` column to a `datetime` object.

In [60]:
ufo['Time'] = pd.to_datetime(ufo['Time'])

In [39]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

### 4) Set the `Time` column to the index of the dataframe.

In [61]:
ufo.set_index('Time', inplace=True)

### 5) Create a `timestamp` object for the date January 1, 1999.

In [62]:
ts = pd.to_datetime('1/1/1999')

In [63]:
jan_1 = datetime(1999, 1, 1)

### 6) Use the `timestamp` object to perform logical filtering on the DataFrame and create a subset of entries with a date above or equal to January 1, 1999.

In [64]:
ufo.loc[ufo.index>jan_1]

                                  City Colors Reported Shape Reported State
Time
1999-01-01 02:30:00          Loma Rica             NaN          LIGHT    CA
1999-01-01 03:00:00            Bauxite             NaN            NaN    AR
1999-01-01 14:00:00           Florence             NaN       CYLINDER    SC
1999-01-01 15:00:00       Lake Henshaw             NaN          CIGAR    CA
1999-01-01 17:15:00  Wilmington Island             NaN          LIGHT    GA
1999-01-01 18:00:00             DeWitt             NaN          LIGHT    AR
1999-01-01 19:12:00  Bainbridge Island             NaN            NaN    WA
1999-01-01 19:30:00      Camano Island             NaN       FIREBALL    WA
1999-01-01 21:00:00    Cheaha Mountain             NaN       TRIANGLE    AL
1999-01-01 21:00:00      Coyoty Canyon             NaN           DISK    NM
1999-01-01 23:59:00     Rancho Cordova             NaN            NaN    CA
1999-01-02 17:42:00            Seattle           GREEN          LIGHT    WA
1999-01-02 18:30:00          Vancouver           GREEN       FIREBALL    WA
1999-01-02 20:00:00        Spirit Lake       RED GREEN          LIGHT    ID
1999-01-02 20:30:00       Jacksonville        RED BLUE          OTHER    FL
1999-01-02 22:12:00         Marysville       RED GREEN         SPHERE    CA
1999-01-03 08:45:00           Bellevue             NaN          LIGHT    WA
1999-01-03 16:31:00             Blithe             NaN          OTHER    CA
1999-01-03 17:00:00       Brigham City             NaN            NaN    UT
1999-01-04 20:00:00           Longview             NaN         CIRCLE    TX
1999-01-04 20:24:00            Redding       RED GREEN       TRIANGLE    CA
1999-01-04 21:50:00         Stillwater             NaN        VARIOUS    NY
1999-01-05 02:00:00           Portland             NaN           OVAL    OR
1999-01-05 05:31:00            Seattle           GREEN       FIREBALL    WA
1999-01-05 05:36:00            Seattle             NaN       TEARDROP    WA
1999-01-05 05:38:00          Bremerton             NaN         CIRCLE    WA
1999-01-05 14:00:00         Estes Park             NaN         CIRCLE    CO
1999-01-05 20:00:00         Alamogordo             NaN           DISK    NM
1999-01-06 21:30:00           Lakeside             NaN          FLASH    CA
1999-01-06 21:50:00             Dallas             NaN       FIREBALL    TX
...                                ...             ...            ...   ...
2000-12-28 18:00:00            Holyoke             NaN        DIAMOND    MA
2000-12-28 18:20:00             Carson             NaN           DISK    CA
2000-12-28 19:10:00           Pasadena           GREEN       FIREBALL    CA
2000-12-29 00:00:00             Austin             NaN      FORMATION    TX
2000-12-29 09:00:00           El Campo             NaN          OTHER    TX
2000-12-29 16:10:00       Garden Grove          ORANGE          LIGHT    CA
2000-12-29 19:30:00      Berthoud Pass             NaN       TRIANGLE    CO
2000-12-29 20:00:00         Sisterdale             NaN        DIAMOND    TX
2000-12-29 20:30:00       Garden Grove             NaN        CHEVRON    CA
2000-12-29 20:30:00        Shasta Lake            BLUE           DISK    CA
2000-12-29 20:50:00           Franklin             NaN           DISK    NH
2000-12-29 21:00:00     Albrightsville             NaN          OTHER    PA
2000-12-29 22:00:00         Greenville             NaN            NaN    SC
2000-12-29 23:30:00            Eufaula             NaN           DISK    OK
2000-12-30 10:00:00        Simi Valley             NaN      FORMATION    CA
2000-12-30 22:00:00      San Francisco             NaN      FORMATION    CA
2000-12-30 22:00:00      San Francisco             NaN       TRIANGLE    CA
2000-12-31 04:00:00         Kingsville             NaN          LIGHT    TX
2000-12-31 11:45:00            Chicago             NaN           DISK    IL
2000-12-31 20:00:00        Pismo Beach             NaN           OVAL    CA
2000-12-31 20:00:00        Pismo Beach             NaN           OVAL    CA
2000-12-31 20:30:00               Lodi             NaN            NaN    WI
2000-12-31 21:00:00          Anchorage             RED        VARIOUS    AK
2000-12-31 22:00:00           Capitola             NaN       TRIANGLE    CA
2000-12-31 23:00:00     Fountain Hills             NaN            NaN    AZ
2000-12-31 23:00:00         Grant Park             NaN       TRIANGLE    IL
2000-12-31 23:00:00        Spirit Lake             NaN           DISK    IA
2000-12-31 23:45:00        Eagle River             NaN            NaN    WI
2000-12-31 23:45:00        Eagle River             RED          LIGHT    WI
2000-12-31 23:59:00               Ybor             NaN           OVAL    FL

[5409 rows x 4 columns]